## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:92" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:92" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:e7a7bf802b1a6ac5e5ff52c7e085bcbd7e973bcadf3ac3a6422ff5021f94df20" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:78f7024012de6a966aa377e96780cf31465fc771660a7f6b867967b116f24bc1"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 92 -> (known after apply)
-       tags                     = {} -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "babfba7b2d73f3232ad5e5b719873610-6" -> "36a5f7cf9c42d57c15cc6cb74a000c36"
        id                     = "graphql.36a5f7cf9c42d57c15cc6cb74a000c36.zip"
        tags                   = {}
      ~ version_id             = "hYkhcgYJ2upkiVxnylU0xIW1j5eMfDSB" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-processValidationJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-processValidationJson" {
      ~ etag                   = "c31b368cf036d6e1e9bb0543d2d9a8aa-5" -> "b8273fdb4bc8f0ae6540ab69af44ff94"
        id                     = "processValidationJson.b8273fdb4bc8f0ae6540ab69af44ff94.zip"
        tags                   = {}
      ~ version_id             = "Ss9VLWIn73uJyuzkv2m1gZddOpF3yHai" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-python must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-python" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/python.66a9dbde94df3417a2316e428847485e.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "32d68036d954099b79d94242211cfe36-4" -> "eb2e8a822a398a83c7fef52787e15d02"
      ~ id                     = "python.66a9dbde94df3417a2316e428847485e.zip" -> (known after apply)
      ~ key                    = "python.66a9dbde94df3417a2316e428847485e.zip" -> "python.eb2e8a822a398a83c7fef52787e15d02.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "66a9dbde94df3417a2316e428847485e" -> "eb2e8a822a398a83c7fef52787e15d02"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "MSBp1R5nPvTdrUszZI4gOdNpFMHMURig" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "6bce45b813c0b0ee02b5c945f05ae409" -> "28563af05ece3beb5f6e35ec6849ae5b"
        id                     = "dist/200.html"
      ~ source_hash            = "6bce45b813c0b0ee02b5c945f05ae409" -> "28563af05ece3beb5f6e35ec6849ae5b"
        tags                   = {}
      ~ version_id             = "3vdKJTZdzbgQbUkbmrQk_506wD03mlN2" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "8dcbe2504174fcf454549876e25e38a9" -> "60867b05c87877a1b51a4b98c9a37c68"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "8dcbe2504174fcf454549876e25e38a9" -> "60867b05c87877a1b51a4b98c9a37c68"
        tags                   = {}
      ~ version_id             = "N18dVnyIVZiOGCIO02PuBLq2Un4ElJTD" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "c198ea80d50669ebe61b6fde87240958" -> "9523f2185ba82b988bbd2521fefab528"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "c198ea80d50669ebe61b6fde87240958" -> "9523f2185ba82b988bbd2521fefab528"
        tags                   = {}
      ~ version_id             = "PDLM1lcr3E5v7YsoeLuK.muqcUVtFdq6" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "6bce45b813c0b0ee02b5c945f05ae409" -> "28563af05ece3beb5f6e35ec6849ae5b"
        id                     = "dist/index.html"
      ~ source_hash            = "6bce45b813c0b0ee02b5c945f05ae409" -> "28563af05ece3beb5f6e35ec6849ae5b"
        tags                   = {}
      ~ version_id             = "rxM9ntfkxPMqdAacMcO9ImNcaaaSGoN2" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.20ad7183.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "cbe21e685ada3914355be4b695f19430"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.20ad7183.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.20ad7183.js"
+       source_hash            = "cbe21e685ada3914355be4b695f19430"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.20ad7183.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "b703266ba347d460c07ac79899e011fa"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.20ad7183.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.20ad7183.js.LICENSE.txt"
+       source_hash            = "b703266ba347d460c07ac79899e011fa"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.c21c7b8c.js"] will be destroyed
  # (because key ["static/js/app.c21c7b8c.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.c21c7b8c.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "5cb69c508c0c9a3871ffa6f5c3efc8cb" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.c21c7b8c.js" -> null
-       key                    = "dist/static/js/app.c21c7b8c.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.c21c7b8c.js" -> null
-       source_hash            = "5cb69c508c0c9a3871ffa6f5c3efc8cb" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "LVI5QisjWwEGGpkclNzXQGTDKQkURKlp" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.c21c7b8c.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.c21c7b8c.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.c21c7b8c.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "b703266ba347d460c07ac79899e011fa" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.c21c7b8c.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.c21c7b8c.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.c21c7b8c.js.LICENSE.txt" -> null
-       source_hash            = "b703266ba347d460c07ac79899e011fa" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "RFr5NKSneoZor45L4SuWo9Eunx1DZfDd" -> null
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-04-15T02:30:33.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:59" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:59/invocations" -> (known after apply)
      ~ s3_key                         = "python.66a9dbde94df3417a2316e428847485e.zip" -> "python.eb2e8a822a398a83c7fef52787e15d02.zip"
        tags                           = {}
      ~ version                        = "59" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "c9674dcac221d2daa60421b0cb21829abed839b6" -> "d13ce4e23104661c9253ac6d62f9d6030ee10652"
              ~ "DD_TAGS"                      = "git.commit.sha:c9674dcac221d2daa60421b0cb21829abed839b6,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:d13ce4e23104661c9253ac6d62f9d6030ee10652,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "c9674dcac221d2daa60421b0cb21829abed839b6" -> "d13ce4e23104661c9253ac6d62f9d6030ee10652"
                # (14 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "59" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_iam_policy.additional_inline[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_inline" {
        id        = "arn:aws:iam::357150818708:policy/cpfreporter-graphql-inline"
        name      = "cpfreporter-graphql-inline"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
+                   {
+                       Action   = [
+                           "s3:HeadObject",
+                           "s3:GetObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:s3:::cpfreporter-reportingdata-357150818708-us-west-2/uploads/*/*/*/*/*.xlsm"
+                       Sid      = "AllowDownloadXLSMFiles"
                    },
                    {
                        Action   = "kms:Decrypt"
                        Effect   = "Allow"
                        Resource = "arn:aws:kms:us-west-2:357150818708:key/df1661b4-62e5-4668-8e39-f872c9acfceb"
                        Sid      = "DecryptPostgresSecret"
                    },
                    # (4 unchanged elements hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:107" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:107/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "107" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "c9674dcac221d2daa60421b0cb21829abed839b6" -> "d13ce4e23104661c9253ac6d62f9d6030ee10652"
              ~ "DD_TAGS"                            = "git.commit.sha:c9674dcac221d2daa60421b0cb21829abed839b6,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:d13ce4e23104661c9253ac6d62f9d6030ee10652,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "c9674dcac221d2daa60421b0cb21829abed839b6" -> "d13ce4e23104661c9253ac6d62f9d6030ee10652"
                # (17 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "107" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-processValidationJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:15" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:15/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "15" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "c9674dcac221d2daa60421b0cb21829abed839b6" -> "d13ce4e23104661c9253ac6d62f9d6030ee10652"
              ~ "DD_TAGS"                      = "git.commit.sha:c9674dcac221d2daa60421b0cb21829abed839b6,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:d13ce4e23104661c9253ac6d62f9d6030ee10652,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "c9674dcac221d2daa60421b0cb21829abed839b6" -> "d13ce4e23104661c9253ac6d62f9d6030ee10652"
                # (13 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "15" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 7 to add, 11 to change, 7 to destroy.
```

</details>

*Pusher: @as1729, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8707983066)*